; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v3 - type_1 ?v1 - type_2)
 	      (pred_1 ?v6 - object ?v1 - type_2)
	      (pred_2 ?v3 - type_1 ?v7 - type_3)
	      (pred_3 ?v3 - type_1 ?v6 - object ?v7 - type_3))

   (:action op_2
       :parameters  (?v3 - type_1 ?v8 ?v5 - type_2)
       :precondition (and  (pred_4 ?v3 ?v8))
       :effect (and  (pred_4 ?v3 ?v5)
		     (not (pred_4 ?v3 ?v8))))

   (:action op_1
       :parameters (?v3 - type_1 ?v2 - object ?v4 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_1 ?v2 ?v4) (pred_4 ?v3 ?v4) (pred_2 ?v3 ?v7))
       :effect (and (pred_3 ?v3 ?v2 ?v7)
		    (not (pred_1 ?v2 ?v4)) 
		    (not (pred_2 ?v3 ?v7))))

   (:action op_3
       :parameters (?v3 - type_1 ?v2 - object ?v4 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_3 ?v3 ?v2 ?v7) (pred_4 ?v3 ?v4))
       :effect (and (pred_1 ?v2 ?v4)
		    (pred_2 ?v3 ?v7)
		    (not (pred_3 ?v3 ?v2 ?v7)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_10 obj_12 - type_1
obj_07 obj_13 obj_08 obj_04 - type_3
obj_02 obj_05 obj_11 obj_01 - type_2
obj_06 obj_09 obj_03 - object)
(:init
(pred_4 obj_10 obj_05)
(pred_2 obj_10 obj_07)
(pred_2 obj_10 obj_13)
(pred_4 obj_12 obj_11)
(pred_2 obj_12 obj_08)
(pred_2 obj_12 obj_04)
(pred_1 obj_06 obj_01)
(pred_1 obj_09 obj_11)
(pred_1 obj_03 obj_05)
)
(:goal
(and
(pred_1 obj_06 obj_11)
(pred_1 obj_09 obj_11)
(pred_1 obj_03 obj_05)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_10 obj_01) (pred_4 obj_12 obj_01))))
  )
)
)

; plan
1. (op_2 obj_10 obj_05 obj_01)
   deleted: (pred_4 obj_10 obj_05)
   added: (pred_4 obj_10 obj_01)
   goals met: 2 of 3
2. (op_1 obj_10 obj_06 obj_01 obj_13)
   deleted: (pred_1 obj_06 obj_01) (pred_2 obj_10 obj_13)
   added: (pred_3 obj_10 obj_06 obj_13)
   goals met: 2 of 3
3. (op_2 obj_10 obj_01 obj_11)
   deleted: (pred_4 obj_10 obj_01)
   added: (pred_4 obj_10 obj_11)
   goals met: 2 of 3
4. (op_3 obj_10 obj_06 obj_11 obj_13)
   deleted: (pred_3 obj_10 obj_06 obj_13)
   added: (pred_1 obj_06 obj_11) (pred_2 obj_10 obj_13)
   goals met: 3 of 3
